# SpecificHeatCapacity Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisMaterial..::..SpecificHeatCapacity Property
EnergyAnalysisMaterial Class See Also
---
The specific heat capacity of the material.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public double SpecificHeatCapacity { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SpecificHeatCapacity As Double
	Get
```

Visual C++
---
```text
public:
property double SpecificHeatCapacity {
	double get ();
}
```

# See Also
EnergyAnalysisMaterial Class
Autodesk.Revit.DB.Analysis Namespace